In [1]:
import pandas as pd

In [4]:
data = [(1,2,3,4),
       (5,6,7,8),
       (9,10,11,12),
       (13,14,15,16)]
df = pd.DataFrame(data, 'linha1 linha2 linha3 linha4'.split(), 'coluna1 coluna2 coluna3 coluna4'.split())
df

        coluna1  coluna2  coluna3  coluna4
linha1        1        2        3        4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

In [6]:
df['coluna1']

linha1     1
linha2     5
linha3     9
linha4    13
Name: coluna1, dtype: int64

In [7]:
type(df['coluna1'])

pandas.core.series.Series

In [12]:
df[ ['coluna1', 'coluna2'] ]

        coluna1  coluna2
linha1        1        2
linha2        5        6
linha3        9       10
linha4       13       14

In [35]:
df[1:4]

        coluna1  coluna2  coluna3  coluna4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

In [36]:
df[1:][['coluna3','coluna1']]

        coluna3  coluna1
linha2        7        5
linha3       11        9
linha4       15       13

In [26]:
df['linha2':'linha4']

        coluna1  coluna2  coluna3  coluna4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

In [30]:
df.loc['linha2':'linha4']

        coluna1  coluna2  coluna3  coluna4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

In [23]:
df[:]

        coluna1  coluna2  coluna3  coluna4
linha1        1        2        3        4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

## .loc Consegue filtrar linha e coluna simultaneamente

In [38]:
df.loc['linha2','coluna3']

7

In [40]:
df.loc[ ['linha2', 'linha3'] , ['coluna3', 'coluna4'] ]

        coluna3  coluna4
linha2        7        8
linha3       11       12

In [41]:
df

        coluna1  coluna2  coluna3  coluna4
linha1        1        2        3        4
linha2        5        6        7        8
linha3        9       10       11       12
linha4       13       14       15       16

In [43]:
df.iloc[[1, 2],[2, 3]]

        coluna3  coluna4
linha2        7        8
linha3       11       12